{
	"id": 1712260893178,
	"title": "Trace Voice Pick",
	"thumbnail": {
		"path": "/projects/1712260893178/thumbnail/figma-sketches.PNG",
		"alt": "Trace Voice Pick thumbnail"
	},
	"images": [
		{
			"path": "/projects/1712260893178/images/figma-sketches.PNG",
			"alt": "Trace Voice Pick image 0"
		},
		{
			"path": "/projects/1712260893178/images/managment-pages.PNG",
			"alt": "Trace Voice Pick image 1"
		},
		{
			"path": "/projects/1712260893178/images/mati-trucking.jpeg",
			"alt": "Trace Voice Pick image 2"
		},
		{
			"path": "/projects/1712260893178/images/profile-pages.PNG",
			"alt": "Trace Voice Pick image 3"
		},
		{
			"path": "/projects/1712260893178/images/swift-page-diagram.png",
			"alt": "Trace Voice Pick image 4"
		}
	],
	"status": "Finished",
	"stack": ["SwiftUI", "Spring-Boot", "PostgreSQL", "Docker", "Keycloak"],
	"contributers": [
		{ "name": "Joakim Edvardsen", "link": "https://github.com/jKm00" },
		{ "name": "Petter Molnes", "link": "https://github.com/PMolnes" },
		{ "name": "Mateusz Picheta", "link": "https://github.com/tama3ti" },
		{ "name": "Håkon Sætre", "link": "https://github.com/Haukaun" }
	],
	"features": [
		"User authentication",
		"Speech recognition",
		"Text to speech",
		"Touch and voice interface",
		"Warehouse management"
	],
	"resources": [
		{
			"label": "Read our thesis at:",
			"link": "https://ntnuopen.ntnu.no/ntnu-xmlui/handle/11250/3076971"
		},
		{
			"label": "Swift frontend repository:",
			"link": "https://gitlab.com/IDATA-2900-Group-1/voice-pick-frontend"
		},
		{
			"label": "Spring-boot API repository:",
			"link": "https://gitlab.com/IDATA-2900-Group-1/voice-pick-backend"
		},
		{
			"label": "YouTube video showing application in action:",
			"link": "https://youtu.be/ldt2QxZ4jbU"
		}
	],
	"desc": "My bachelor thesis project involved the development of a comprehensive iOS application using SwiftUI for efficient product plucking in a warehouse setting. The application incorporated a unique concept where employees could simultaneously utilize voice and touch interfaces for seamless plucking operations. Additionally, we designed and implemented a robust Spring Boot API to support a fully functional warehouse management system.",
	"text": "In my bachelor thesis, our team focused on developing a comprehensive solution to enhance the productivity of employees in warehouses. These employees are responsible for plucking products from shelves and loading them onto pallets before shipping them to local grocery stores. Currently, they rely solely on a voice-based system, where they communicate through voice commands. However, we aimed to revolutionize this process by creating a mobile application that combines both voice and touch interfaces. This empowers employees to choose the interface that best suits their needs, ensuring a more efficient workflow. While the voice interface offers hands-free operation for driving trucks and plucking products, the touch interface accelerates more complex actions.\r\n\r\nOur final product was an iOS application that can be easily downloaded by anyone. The application provides users with the ability to create their own accounts and configure their warehouses with specific locations, products, and employees. Furthermore, we implemented an invitations feature, enabling warehouse leaders to invite other users to join their warehouses. This functionality fosters collaboration and streamlines communication within and across warehouses. Overall, the project was a resounding success, meeting and exceeding the requirements and requests of our employees.\r\n\r\nThroughout the development process, our team gained valuable insights and knowledge. We encountered various challenges and learned to navigate them effectively. By working on this project, we honed our skills in iOS application development using SwiftUI, as well as in designing and implementing a robust Spring Boot API to support the warehouse management system. Additionally, we gained a deeper understanding of the user experience and the importance of providing flexible interface options to cater to diverse user preferences and workflows.\r\n\r\nThe bachelor thesis project not only allowed us to showcase our technical capabilities but also highlighted our ability to understand and address the needs of end-users. By actively involving employees and incorporating their feedback, we ensured that the final product aligned with their requirements and expectations. This experience further solidified our passion for software development and reinforced the value of creating user-centered solutions.\r\n\r\nOverall, our bachelor thesis project was a significant achievement, both in terms of technical implementation and fulfilling the needs of warehouse employees. We are proud of the final product we delivered and the knowledge we acquired throughout the process, paving the way for future opportunities in the field of software development.",
	"published": true
}
