{
	"id": 1712261483960,
	"title": "Sphere",
	"thumbnail": {
		"path": "/projects/1712261483960/thumbnail/dashboard.PNG",
		"alt": "Sphere thumbnail"
	},
	"images": [
		{ "path": "/projects/1712261483960/images/landing-page.PNG", "alt": "Sphere image 1" },
		{ "path": "/projects/1712261483960/images/login-page.PNG", "alt": "Sphere image 3" },
		{ "path": "/projects/1712261483960/images/dashboard.PNG", "alt": "Sphere image 0" },
		{ "path": "/projects/1712261483960/images/light-mode.PNG", "alt": "Sphere image 2" }
	],
	"status": "Finished",
	"stack": ["SvelteKit", "Postgres", "Prisma", "Lucia", "Shadcn", "Tailwind"],
	"contributers": [{ "name": "Joakim Edvardsen", "link": "https://github.com/jKm00" }],
	"features": [
		"Email authentication",
		"OAuth",
		"Light/Dark mode",
		"Progressive web app",
		"Playwright testing"
	],
	"resources": [
		{ "label": "Live website:", "link": "https://sphere.edvardsen.dev/" },
		{ "label": "Repository:", "link": "https://github.com/jKm00/sphere" }
	],
	"desc": "Sphere is an application that helps you keep track of your subscriptions. With a dashboard that shows you the total cost of all your subscriptions, as well as a list of all your subscriptions and the ability to add new ones.",
	"text": "Sphere is a small web application that helps you keep track of your subscriptions. The main idea is to give a quick overview of all your subscription expenses.\r\n\r\nThe application provides a dashboard that displays the total cost of all your subscriptions, how many subscriptions you have, and which of your subscriptions are the most expensive. In addition, the dashboard provides a table that shows more detailed information about each individual subscription with quick access to actions.\r\n\r\nFrom the dashboard, a user can easily add new subscriptions, update existing ones, or delete subscriptions they no longer need. Additionally, users can choose their preffered currency and period (like monthly, yearly etc.). The application uses this information and calculates the values to the user's desire based on the current exchange rates.\r\n\r\nThe application is built with SvelteKit and uses Prisma as an ORM to interact with the Postgres database. The UI is built using Shadcn and Tailwind. For authentication, the application implements Lucia which is an auth library that abstracts away the complexity of handling sessions. The application implements PWA with service workers allowing users to download the website as an application on their mobile device. Because of this, the website was developed with a mobile first approach ensuring that it looks great on all screen sizes. Additionally, playwright has been used extensively for testing the server side logic.",
	"published": true
}
