{
	"id": 1712261227662,
	"title": "CSGO Nade App",
	"thumbnail": {
		"path": "/projects/1712261227662/thumbnail/view-strat.PNG",
		"alt": "CSGO Nade App thumbnail"
	},
	"images": [
		{ "path": "/projects/1712261227662/images/landing-page.PNG", "alt": "CSGO Nade App image 3" },
		{ "path": "/projects/1712261227662/images/create-strat.PNG", "alt": "CSGO Nade App image 0" },
		{ "path": "/projects/1712261227662/images/strats.PNG", "alt": "CSGO Nade App image 5" },
		{ "path": "/projects/1712261227662/images/filters.PNG", "alt": "CSGO Nade App image 2" },
		{ "path": "/projects/1712261227662/images/view-strat.PNG", "alt": "CSGO Nade App image 7" },
		{ "path": "/projects/1712261227662/images/view-nade.PNG", "alt": "CSGO Nade App image 6" },
		{ "path": "/projects/1712261227662/images/settings-page.PNG", "alt": "CSGO Nade App image 4" },
		{ "path": "/projects/1712261227662/images/custom-avatar.PNG", "alt": "CSGO Nade App image 1" }
	],
	"status": "In-progress",
	"stack": ["SvelteKit", "Supabase", "Netlify", "Tailwind", "TypeScript"],
	"contributers": [{ "name": "Joakim Edvardsen", "link": "https://github.com/jKm00" }],
	"features": [
		"User authentiation with third party OAuth",
		"Custom avatar",
		"Create a CS:GO team",
		"Create strats with image uploads",
		"Share strats publicly or with team member",
		"Search for strats one different CS2 maps"
	],
	"resources": [
		{ "label": "Repository:", "link": "https://github.com/jKm00/csgo-nade-app" },
		{ "label": "Live website:", "link": "https://csgostrats.com/" }
	],
	"desc": "CSGO Strats is an open-source project to create a CSGO website where players can create and share strategies with the community and their teams. With user authentication, team and start creation, and the ability to upload images illustrating nade lineups, CSGO Strats provides a platform for gamers to enhance their gameplay.",
	"text": "In my free time, I am currently developing a CSGO website called CSGO Strats. The idea behind the project is to allow CSGO players to create and share strategies, both publicly with the community and privately with their team members.\r\n\r\nThe project is open-source and utilizes SvelteKit together with Supabase, providing a developer-friendly full-stack solution. The website is hosted on Netlify, with a CI/CD infrastructure that streamlines the process of pushing new versions.\r\n\r\nSeveral features have already been implemented in the project. First and foremost, there is user authentication available, enabling users to register and log in using their email. Additionally, I have integrated third-party OAuth services such as Discord and GitHub, offering convenient and secure login options. Users have the flexibility to customize their avatars, selecting from a diverse range of profile pictures generated by Midjourney.\r\n\r\nUsers can create strats that include a collection of nades. For each nade, the user can upload images illustrating how the nades are thrown and where they impact the map. These strats can be shared publicly with the community, or the author of the strat can choose to keep the strat private. By default, private strats can only be viewed by the author, unless the strat is associated with a team (which the author can specify). In that case, the strat will be available to all members of the team.\r\n\r\nVersion 1.0.0 is out and can be viewed on the live website, with many exciting and interesting ideas for a future version 2.0.0.",
	"published": true
}
