{
	"id": 1712260266879,
	"title": "XXS - Hiking Equipments",
	"thumbnail": {
		"path": "/projects/1712260266879/thumbnail/xxs-thumbnail-compressed.jpg",
		"alt": "XXS - Hiking Equipments thumbnail"
	},
	"images": [
		{
			"path": "/projects/1712260266879/images/home-page-hero-compressed.jpg",
			"alt": "XXS - Hiking Equipments image 2"
		},
		{
			"path": "/projects/1712260266879/images/home-page-about-compressed.jpg",
			"alt": "XXS - Hiking Equipments image 1"
		},
		{
			"path": "/projects/1712260266879/images/home-page-reviews-compressed.jpg",
			"alt": "XXS - Hiking Equipments image 3"
		},
		{
			"path": "/projects/1712260266879/images/shop-page-compressed.jpg",
			"alt": "XXS - Hiking Equipments image 6"
		},
		{
			"path": "/projects/1712260266879/images/product-page-compressed.jpg",
			"alt": "XXS - Hiking Equipments image 4"
		},
		{
			"path": "/projects/1712260266879/images/shopping-cart-compressed.jpg",
			"alt": "XXS - Hiking Equipments image 7"
		},
		{
			"path": "/projects/1712260266879/images/profile-page-compressed.jpg",
			"alt": "XXS - Hiking Equipments image 5"
		},
		{
			"path": "/projects/1712260266879/images/footer-compressed.jpg",
			"alt": "XXS - Hiking Equipments image 0"
		}
	],
	"status": "Finished",
	"stack": ["Spring-Boot", "Docker", "PostgreSQL", "Nginx"],
	"contributers": [
		{ "name": "Eduard Christea", "link": "https://github.com/falniir" },
		{ "name": "Joakim Edvardsen", "link": "https://github.com/jKm00" },
		{ "name": "Richileu Bailey", "link": "https://github.com/Richileu-A-Bailey" },
		{ "name": "Torstein Eide", "link": "https://github.com/TorsteinEide" }
	],
	"features": [
		"User authentication",
		"Shopping cart",
		"Dynamically loaded products",
		"Image showcase with carousels",
		"Admin page for product/user updates"
	],
	"resources": [{ "label": "Repository:", "link": "https://github.com/jKm00/hiking-equipment" }],
	"desc": "As part of my bachelor degree, I together with three other students was given a fictional company selling premium hiking equipment. Together we planned out and developed a webshop selling their products as well as their values. Everything from design to implementation.",
	"text": "In my fourth semester of my bachelor I had two courses, web technologies and application development. Throughout the semester, next to the lectures, we had an ongoing project combining what we learned in both the subjects to create a website.\r\n\r\nAs this was quite a large project, we had to work in group. Both to distribute the work load, but also to get experience working with a team as this is normally how developers work.\r\n\r\nThe beginning was a lot of planning. Creating wireframes, sketching the design of the database, creating a design guideline etc. We had many team meetings a this point to share and discuss different options and opinions until we were satisfied.\r\n\r\nSpring boot was taught in the application coures, so this was the framework we desided to use for our API. As for the frontend, HTML, CSS and JavaScript was taught in the web technologies course, but our group desided to use React as our frontend framework as some members already had some experience with it. For our database we used PostgreSQL, as again, member of the group had experience with it. At the very end of the project we also desided that we were to dockerize our app, to make it easier for production.\r\n\r\nThroughout the development github was actively used. Every meeting, we discussed things that needed to be implemented and/or changed and filed it as github issues. With this, it was easy for a single member to pick an issue from the issue list, work with it on a new branch, and then merge it back into the main branch with a simple pull request. This also made it possible to add code review to our workflow. Both to make sure the implemented was ok, but also so members that didn't implement sertain features could understand it by looking through it when it was finished and approve it.\r\n\r\nThis project was a great success. We reached all our goals and learned a lot along the process.",
	"published": true
}
